[
  {
    "date": "2025-12-01",
    "projects": [
      {
        "name": "Pairing-Based SNARGs with Two Group Elements",
        "url": "https://eprint.iacr.org/2025/2160",
        "type": "论文",
        "tags": [
          "Gal Arnon",
          "Random Oracle Model"
        ],
        "slogan": {
          "zh": "【ZK论文】\nSNARG 证明最小能有多小？最新论文给出的答案是：2 个群元素"
        },
        "summary": {
          "zh": "Arnon等人提出了一种公开可验证SNARG，证明仅含两个群元素且无额外比特，在GGM + ROM中实现最小证明尺寸，并建立了单群元素SNARG的下界。",
          "en": "Arnon et al. proposed a publicly verifiable SNARG, which only contains two group elements and no additional bits, achieving the minimum proof size in GGM + ROM, and establishing a lower bound for single group element SNARGs."
        },
        "notes": {
          "zh": [
            "提出首个公开可验证SNARG，证明仅两个群元素，无额外比特",
            "在GGM + ROM中实现最小证明尺寸，BLS12-381实例下为768比特",
            "安全性分析紧密，无隐藏安全损失",
            "建立新下界：单群元素SNARG在GGM + ROM中不可行",
            "证明尺寸较现有方案提升近2倍，但尚未具体高效",
            "为未来实用实例化铺平道路，强化了Groth的下界"
          ],
          "en": [
            "Proposed the first publicly verifiable SNARG, which only contains two group elements and no additional bits, achieving the minimum proof size in GGM + ROM, and establishing a lower bound for single group element SNARGs.",
            "Achieves the minimum proof size in GGM + ROM, with BLS12-381 instance size of 768 bits",
            "Tight security analysis with no hidden security losses",
            "Establishes a new lower bound: single group element SNARGs are impossible in GGM + ROM",
            "Proof size is nearly twice that of existing schemes, but not yet specifically efficient",
            "Paves the way for future practical instantiation, reinforcing Groth's lower bound"
          ]
        }
      }
    ]
  },
  {
    "date": "2025-12-02",
    "projects": [
      {
        "name": "Sum-check protocol for approximate computations",
        "url": "https://eprint.iacr.org/2025/2152",
        "type": "论文",
        "tags": [
          "Dor Bitan",
          "Probabilistic proofs"
        ],
        "slogan": {
          "zh": "【ZK论文】\n验证计算也能允许一点误差？sum-check 新扩展太有意思了"
        },
        "summary": {
          "zh": "Bitan等人在{{name}}论文中提出了一种近似计算的sum-check协议扩展，利用低度多项式的度量结构，支持可调误差参数，并分析了Fiat-Shamir变换下的安全性。",
          "en": "Bitan et al. proposed an extension of the sum-check protocol for approximate computations, using the metric structure of low-degree polynomials, supporting adjustable error parameters, and analyzing the security under Fiat-Shamir transformation."
        },
        "notes": {
          "zh": [
            "协议扩展sum-check以处理近似计算，支持可调误差参数δ",
            "可靠性误差随δ/Δ优雅下降，初始误差Δ大时验证者更易拒绝",
            "利用低度多项式的度量结构，区别于经典代数方法",
            "复数域实例化最自然，分析基于单位圆上的多项式行为",
            "Fiat-Shamir变换下出现新的中间安全现象，与近似相关",
            "实现黑盒可行性，编译器独立于算术操作实现，仅需满足误差界"
          ],
          "en": [
            "Protocol extends sum-check for approximate computations, supporting adjustable error parameters δ",
            "Soundness error gracefully decreases with δ/Δ, validators may reject with initial error Δ large",
            "Utilizes the metric structure of low-degree polynomials, distinct from classic algebraic methods",
            "Natural instantiation over complex numbers, analysis based on polynomial behavior on the unit circle",
            "New intermediate security phenomena appear under Fiat-Shamir transformation, related to approximation",
            "Achieves black-box feasibility, compiler independent of arithmetic operations, only needing to satisfy error bounds"
          ]
        }
      }
    ]
  },
  {
    "date": "2025-12-03",
    "projects": [
      {
        "name": "OpenAC: Open Design for Transparent and Lightweight Anonymous Credentials",
        "url": "https://github.com/privacy-ethereum/zkID/blob/main/paper/zkID.pdf",
        "type": "论文",
        "tags": [
          "zkID",
          "privacy-ethereum"
        ],
        "summary": {
          "zh": "PSE的zkID团队在{{name}}论文中提出了基于ZKP的去中心化身份方案OpenAC，旨在增强用户隐私保护和身份验证安全性。",
          "en": "PSE's zkID team proposed OpenAC, a decentralized identity scheme based on ZKP, to enhance user privacy protection and identity authentication security."
        },
        "notes": {
          "zh": [
            "OpenAC 在不改 Issuer 的前提下提供匿名与选择性披露。",
            "Prepare–Show 结构将重计算离线化以降低在线成本。",
            "Hyrax 承诺用于隐藏、绑定与重随机化避免链接。",
            "基于透明 zk-Spartan，无需 trusted setup。",
            "Show 证明移动端约 100ms、40KB。",
            "兼容 SD-JWT/mDL 与 EUDI ARF，具 PQ 升级空间。"
          ],
          "en": [
            "OpenAC adds anonymity and selective disclosure without changing issuers.",
            "A Prepare–Show split moves heavy work offline to cut online cost.",
            "Hyrax commitments enable hiding, binding, and unlinkability via re-randomization.",
            "Built on transparent zk-Spartan with no trusted setup.",
            "Show proofs run ~100 ms and ~40 KB on mobile.",
            "Compatible with SD-JWT/mDL and EUDI ARF, with room for PQ upgrades."
          ]
        }
      }
    ]
  }
]