[
  {
    "date": "2026-01-05",
    "projects": [
      {
        "name": "DNS-Anchored zk-SNARK Proofs: A Stateless Alternative to ACME Challenge-Response for Domain Control Validation",
        "url": "https://eprint.iacr.org/2025/2332",
        "type": "论文",
        "tags": [
          "Abhinav Vishnu",
          "DNS",
          "ACME"
        ],
        "summary": {
          "zh": "Abhinav Vishnu在{{name}}论文中提出了PTX协议，利用zkSNARK实现异步、非交互式域控制验证，无需活动服务器，通过DNS TXT记录锚定证明。",
          "en": "Abhinav Vishnu proposed the PTX protocol in {{name}}paper, using zkSNARK for asynchronous, non-interactive domain control validation without active servers, anchored via DNS TXT records."
        },
        "notes": {
          "zh": [
            "PTX协议利用zkSNARK实现异步、非交互式域控制验证，替代传统ACME协议",
            "通过DNS TXT记录锚定证明，无需活动Web服务器或开放网络端口",
            "电路设计将临时秘密绑定到范围元数据，支持客户端验证和隐私保护",
            "使用Groth16和Poseidon实现，仅1,756约束，验证时间低于15ms",
            "有效缓解重放攻击，适用于无服务器、静态和隔离部署环境",
            "为去中心化环境中的身份断言提供隐私保护替代方案"
          ],
          "en": [
            "PTX protocol uses zkSNARK for asynchronous, non-interactive domain control validation, replacing traditional ACME",
            "Anchors proofs via DNS TXT records, eliminating need for active web servers or open ports",
            "Circuit design binds ephemeral secrets to scoped metadata, enabling client-side verification and privacy",
            "Implemented with Groth16 and Poseidon, only 1,756 constraints, verification under 15ms",
            "Mitigates replay attacks, suitable for serverless, static, and air-gapped deployments",
            "Provides privacy-preserving alternative for identity assertions in decentralized environments"
          ]
        },
        "slogan": {
          "zh": "【ZK论文】告别 ACME 挑战：用 zkSNARK 在 DNS 上完成域名验证"
        }
      }
    ]
  },
  {
    "date": "2026-01-06",
    "projects": [
      {
        "name": "SUMSIG: Compact Code-Based Signatures from Sum-Check Protocols",
        "url": "https://eprint.iacr.org/2025/2331",
        "type": "论文",
        "tags": [
          "Debrup Chatterjee",
          "Syndrome Decoding"
        ],
        "summary": {
          "zh": "Debrup Chatterjee在{{name}}论文中提出了SumSig，一种基于编码的数字签名方案，利用Sum-Check协议减少对重复的依赖，通过单次扩展域验证实现可忽略的误差，签名约5-8KB。",
          "en": "Debrup Chatterjee proposed SumSig, a code-based digital signature scheme leveraging sum-check protocols to reduce repetition reliance, achieving negligible error via single extension field verification, with signatures ~5-8KB."
        },
        "notes": {
          "zh": [
            "SumSig利用Sum-Check协议替代重复Σ协议，减少签名生成依赖",
            "通过扩展域单次验证实现可忽略的误差，无需重复操作",
            "签名大小约5-8KB，公钥50-100KB，提供不同权衡",
            "基于Syndrome Decoding问题，在随机预言模型中有准紧规约",
            "相比Wave和LESS等方案，在签名和公钥大小间提供新选择",
            "这是首次公开版本，欢迎反馈，关注后量子密码学进展"
          ],
          "en": [
            "SumSig uses sum-check protocols to replace repetitive Σ-protocols, reducing signature generation reliance.",
            "Achieves negligible error via single extension field verification without repetition.",
            "Signature size ~5-8KB, public key 50-100KB, offering different trade-offs.",
            "Based on Syndrome Decoding problem with quasi-tight reduction in random oracle model.",
            "Provides new choice in signature/public key size compared to Wave and LESS.",
            "First public version; feedback welcome, focusing on post-quantum cryptography."
          ]
        },
        "slogan": {
          "zh": "【ZK论文】后量子签名新突破：SumSig用Sum-Check协议实现紧凑签名"
        }
      }
    ]
  },
  {
    "date": "2026-01-07",
    "projects": [
      {
        "name": "The Future of Financial Infrastructure: Ethereum's Layer 2 Landscape - Report",
        "url": "https://www.nethermind.io/blog/the-future-of-financial-infrastructure-ethereums-layer-2-landscape-report",
        "type": "博客",
        "tags": [
          "Nethermind",
          "Layer 2",
          "Compliance"
        ],
        "summary": {
          "zh": "Nethermind联合L2BEAT和Etherealize发布报告，分析以太坊Layer 2网络如何成为机构金融核心基础设施，涵盖可扩展性、安全性、合规性及ZK证明应用。",
          "en": "Nethermind, L2BEAT, and Etherealize jointly published a report analyzing how Ethereum Layer 2 networks are evolving into core infrastructure for institutional finance, covering scalability, security, compliance, and ZK proof applications."
        },
        "notes": {
          "zh": [
            "机构正从试点转向生产系统，如摩根大通、贝莱德等使用以太坊基础设施进行支付和资产代币化。",
            "Layer 2网络通过ZK证明提供隐私和可扩展性，支持自定义执行环境和合规框架。",
            "Rollup（Op和ZK）提供最高安全性，继承以太坊验证和数据可用性，适合高价值工作流。",
            "公共和私有Layer 2模型支持不同操作需求，均锚定以太坊结算，保持互操作性。",
            "合规性通过链上身份、基于规则的传输和ZK证明得到加强，减少对链下流程的依赖。",
            "案例研究包括摩根大通在Base测试存款代币、Visa实验ZK证明用于私有代币化支付。"
          ],
          "en": [
            "Institutions like JPMorgan and BlackRock are using Ethereum Layer 2 for payments and tokenized assets.",
            "L2s leverage ZK proofs for privacy, scalability, and compliance.",
            "Rollups inherit Ethereum security and data availability.",
            "Both public and private L2s settle on Ethereum, ensuring interoperability.",
            "Compliance benefits from onchain identity and ZK proofs.",
            "Examples: JPMorgan testing deposit tokens on Base; Visa piloting ZK proof payments."
          ]
        },
        "slogan": {
          "zh": "【ZK报告】以太坊Layer 2报告：ZK证明助力机构金融合规与隐私"
        }
      }
    ]
  },
  {
    "date": "2026-01-08",
    "projects": [
      {
        "name": "A SNARK for (Non-)Subsequences with Text-Sub-Linear Proving Time",
        "url": "https://eprint.iacr.org/2026/008",
        "type": "论文",
        "tags": [
          "Dario Fiore",
          "cached quotients"
        ],
        "summary": {
          "zh": "Fiore等人在{{name}}论文中提出了一种用于（非）子序列关系的SNARK方案，通过预处理和缓存商技术，将证明时间优化至文本次线性级别。",
          "en": "Fiore et al. proposed a SNARK scheme for (non-)subsequence relations in their {{name}}paper, achieving text-sub-linear proving time via preprocessing and cached quotients."
        },
        "notes": {
          "zh": [
            "提出一种SNARK方案，用于验证字符串是否为文本的子序列或非子序列",
            "方案分为预处理阶段和（非）子序列证明阶段，假设子序列长度远小于文本长度",
            "预处理仅依赖文本和字母表，可提前计算，无需知道子序列",
            "采用缓存商技术，预处理运行时间拟线性于文本长度加字母表大小",
            "证明（非）子序列的运行时间为子序列长度的对数级别，实现文本次线性证明时间",
            "应用场景包括基因分析、区块链、自然语言处理等领域"
          ],
          "en": [
            "SNARK for verifying (non-)subsequence between strings.",
            "Has preprocessing and proof phases; assumes short subsequence.",
            "Preprocessing uses only text and alphabet, no need for subsequence.",
            "Employs cached quotients for quasilinear preprocessing.",
            "Proof time is logarithmic in subsequence length.",
            "Useful for genomics, blockchains, NLP, etc."
          ]
        },
        "slogan": {
          "zh": "【ZK论文】如果区块链需要验证文本或基因数据，这篇 SNARK 方案可能是关键"
        }
      }
    ]
  },
  {
    "date": "2026-01-10",
    "projects": [
      {
        "name": "Predictions for Privacy in 2026",
        "url": "https://x.com/0xMiden/status/2006412050956800288",
        "type": "新闻",
        "tags": [
          "@0xMiden",
          "Stablecoins",
          "Compliance"
        ],
        "summary": {
          "zh": "@0xMiden分享了四位隐私领域专家对2026年隐私发展的预测，包括私有稳定币、隐私工业化、实用性隐私和威胁抵抗隐私等趋势。",
          "en": "@0xMiden shared predictions from four privacy experts for 2026, covering trends like private stablecoins, privacy industrialization, practical privacy, and threat-resistant privacy."
        },
        "notes": {
          "zh": [
            "2026年私有稳定币将成为全球支付基础设施核心层，支持**可配置隐私**如选择性披露和匿名性。",
            "隐私技术将从测试网进入生产阶段，但钱包支持和合规性仍是挑战，规模化需解决这些问题。",
            "隐私不是非黑即白，需在特定场景下做出权衡，提供**条件隐私**以增强协议威胁抵抗力。",
            "**威胁抵抗隐私**将成为默认标准，包括限制性隐私和负责任隐私两类解决方案。",
            "企业需要隐私保护敏感商业关系，而零售用户拒绝完全透明的支付轨道。",
            "隐私系统将整合政策控制，在合规的同时不牺牲基础隐私，重新定义链上合规支付。"
          ],
          "en": [
            "Private stablecoins will play a central role in global payments, offering **configurable privacy**.",
            "Privacy tech is moving to production, but wallet support and compliance remain challenges.",
            "Privacy involves tradeoffs; **conditional privacy** improves threat resistance.",
            "**Threat-resistant privacy** will become standard, with throttled and responsible options.",
            "Enterprises need confidentiality; retail users oppose fully transparent payments.",
            "Privacy systems will add policy controls for compliance while preserving core privacy."
          ]
        },
        "slogan": {
          "zh": "【ZK新闻】2026隐私预测：私有稳定币崛起，威胁抵抗成新常态"
        }
      }
    ]
  }
]