[
  {
    "date": "2026-01-05",
    "projects": [
      {
        "name": "DNS-Anchored zk-SNARK Proofs: A Stateless Alternative to ACME Challenge-Response for Domain Control Validation",
        "url": "https://eprint.iacr.org/2025/2332",
        "type": "论文",
        "tags": [
          "Abhinav Vishnu",
          "DNS",
          "ACME"
        ],
        "summary": {
          "zh": "Abhinav Vishnu在{{name}}论文中提出了PTX协议，利用zkSNARK实现异步、非交互式域控制验证，无需活动服务器，通过DNS TXT记录锚定证明。",
          "en": "Abhinav Vishnu proposed the PTX protocol in {{name}}paper, using zkSNARK for asynchronous, non-interactive domain control validation without active servers, anchored via DNS TXT records."
        },
        "notes": {
          "zh": [
            "PTX协议利用zkSNARK实现异步、非交互式域控制验证，替代传统ACME协议",
            "通过DNS TXT记录锚定证明，无需活动Web服务器或开放网络端口",
            "电路设计将临时秘密绑定到范围元数据，支持客户端验证和隐私保护",
            "使用Groth16和Poseidon实现，仅1,756约束，验证时间低于15ms",
            "有效缓解重放攻击，适用于无服务器、静态和隔离部署环境",
            "为去中心化环境中的身份断言提供隐私保护替代方案"
          ],
          "en": [
            "PTX protocol uses zkSNARK for asynchronous, non-interactive domain control validation, replacing traditional ACME",
            "Anchors proofs via DNS TXT records, eliminating need for active web servers or open ports",
            "Circuit design binds ephemeral secrets to scoped metadata, enabling client-side verification and privacy",
            "Implemented with Groth16 and Poseidon, only 1,756 constraints, verification under 15ms",
            "Mitigates replay attacks, suitable for serverless, static, and air-gapped deployments",
            "Provides privacy-preserving alternative for identity assertions in decentralized environments"
          ]
        },
        "slogan": {
          "zh": "【ZK论文】告别 ACME 挑战：用 zkSNARK 在 DNS 上完成域名验证"
        }
      }
    ]
  },
  {
    "date": "2026-01-06",
    "projects": [
      {
        "name": "SUMSIG: Compact Code-Based Signatures from Sum-Check Protocols",
        "url": "https://eprint.iacr.org/2025/2331",
        "type": "论文",
        "tags": [
          "Debrup Chatterjee",
          "Syndrome Decoding"
        ],
        "summary": {
          "zh": "Debrup Chatterjee在{{name}}论文中提出了SumSig，一种基于编码的数字签名方案，利用Sum-Check协议减少对重复的依赖，通过单次扩展域验证实现可忽略的误差，签名约5-8KB。",
          "en": "Debrup Chatterjee proposed SumSig, a code-based digital signature scheme leveraging sum-check protocols to reduce repetition reliance, achieving negligible error via single extension field verification, with signatures ~5-8KB."
        },
        "notes": {
          "zh": [
            "SumSig利用Sum-Check协议替代重复Σ协议，减少签名生成依赖",
            "通过扩展域单次验证实现可忽略的误差，无需重复操作",
            "签名大小约5-8KB，公钥50-100KB，提供不同权衡",
            "基于Syndrome Decoding问题，在随机预言模型中有准紧规约",
            "相比Wave和LESS等方案，在签名和公钥大小间提供新选择",
            "这是首次公开版本，欢迎反馈，关注后量子密码学进展"
          ],
          "en": [
            "SumSig uses sum-check protocols to replace repetitive Σ-protocols, reducing signature generation reliance.",
            "Achieves negligible error via single extension field verification without repetition.",
            "Signature size ~5-8KB, public key 50-100KB, offering different trade-offs.",
            "Based on Syndrome Decoding problem with quasi-tight reduction in random oracle model.",
            "Provides new choice in signature/public key size compared to Wave and LESS.",
            "First public version; feedback welcome, focusing on post-quantum cryptography."
          ]
        },
        "slogan": {
          "zh": "【ZK论文】后量子签名新突破：SumSig用Sum-Check协议实现紧凑签名"
        }
      }
    ]
  },
  {
    "date": "2026-01-07",
    "projects": [
      {
        "name": "The Future of Financial Infrastructure: Ethereum's Layer 2 Landscape - Report",
        "url": "https://www.nethermind.io/blog/the-future-of-financial-infrastructure-ethereums-layer-2-landscape-report",
        "type": "博客",
        "tags": [
          "Nethermind",
          "Layer 2",
          "Compliance"
        ],
        "summary": {
          "zh": "Nethermind联合L2BEAT和Etherealize发布报告，分析以太坊Layer 2网络如何成为机构金融核心基础设施，涵盖可扩展性、安全性、合规性及ZK证明应用。",
          "en": "Nethermind, L2BEAT, and Etherealize jointly published a report analyzing how Ethereum Layer 2 networks are evolving into core infrastructure for institutional finance, covering scalability, security, compliance, and ZK proof applications."
        },
        "notes": {
          "zh": [
            "机构正从试点转向生产系统，如摩根大通、贝莱德等使用以太坊基础设施进行支付和资产代币化。",
            "Layer 2网络通过ZK证明提供隐私和可扩展性，支持自定义执行环境和合规框架。",
            "Rollup（Op和ZK）提供最高安全性，继承以太坊验证和数据可用性，适合高价值工作流。",
            "公共和私有Layer 2模型支持不同操作需求，均锚定以太坊结算，保持互操作性。",
            "合规性通过链上身份、基于规则的传输和ZK证明得到加强，减少对链下流程的依赖。",
            "案例研究包括摩根大通在Base测试存款代币、Visa实验ZK证明用于私有代币化支付。"
          ],
          "en": [
            "Institutions like JPMorgan and BlackRock are using Ethereum Layer 2 for payments and tokenized assets.",
            "L2s leverage ZK proofs for privacy, scalability, and compliance.",
            "Rollups inherit Ethereum security and data availability.",
            "Both public and private L2s settle on Ethereum, ensuring interoperability.",
            "Compliance benefits from onchain identity and ZK proofs.",
            "Examples: JPMorgan testing deposit tokens on Base; Visa piloting ZK proof payments."
          ]
        },
        "slogan": {
          "zh": "【ZK报告】以太坊Layer 2报告：ZK证明助力机构金融合规与隐私"
        }
      }
    ]
  },
  {
    "date": "2026-01-08",
    "projects": [
      {
        "name": "A SNARK for (Non-)Subsequences with Text-Sub-Linear Proving Time",
        "url": "https://eprint.iacr.org/2026/008",
        "type": "论文",
        "tags": [
          "Dario Fiore",
          "cached quotients"
        ],
        "summary": {
          "zh": "Fiore等人在{{name}}论文中提出了一种用于（非）子序列关系的SNARK方案，通过预处理和缓存商技术，将证明时间优化至文本次线性级别。",
          "en": "Fiore et al. proposed a SNARK scheme for (non-)subsequence relations in their {{name}}paper, achieving text-sub-linear proving time via preprocessing and cached quotients."
        },
        "notes": {
          "zh": [
            "提出一种SNARK方案，用于验证字符串是否为文本的子序列或非子序列",
            "方案分为预处理阶段和（非）子序列证明阶段，假设子序列长度远小于文本长度",
            "预处理仅依赖文本和字母表，可提前计算，无需知道子序列",
            "采用缓存商技术，预处理运行时间拟线性于文本长度加字母表大小",
            "证明（非）子序列的运行时间为子序列长度的对数级别，实现文本次线性证明时间",
            "应用场景包括基因分析、区块链、自然语言处理等领域"
          ],
          "en": [
            "SNARK for verifying (non-)subsequence between strings.",
            "Has preprocessing and proof phases; assumes short subsequence.",
            "Preprocessing uses only text and alphabet, no need for subsequence.",
            "Employs cached quotients for quasilinear preprocessing.",
            "Proof time is logarithmic in subsequence length.",
            "Useful for genomics, blockchains, NLP, etc."
          ]
        },
        "slogan": {
          "zh": "【ZK论文】如果区块链需要验证文本或基因数据，这篇 SNARK 方案可能是关键"
        }
      }
    ]
  },
  {
    "date": "2026-01-10",
    "projects": [
      {
        "name": "Predictions for Privacy in 2026",
        "url": "https://x.com/0xMiden/status/2006412050956800288",
        "type": "新闻",
        "tags": [
          "@0xMiden",
          "Stablecoins",
          "Compliance"
        ],
        "summary": {
          "zh": "@0xMiden分享了四位隐私领域专家对2026年隐私发展的预测，包括私有稳定币、隐私工业化、实用性隐私和威胁抵抗隐私等趋势。",
          "en": "@0xMiden shared predictions from four privacy experts for 2026, covering trends like private stablecoins, privacy industrialization, practical privacy, and threat-resistant privacy."
        },
        "notes": {
          "zh": [
            "2026年私有稳定币将成为全球支付基础设施核心层，支持**可配置隐私**如选择性披露和匿名性。",
            "隐私技术将从测试网进入生产阶段，但钱包支持和合规性仍是挑战，规模化需解决这些问题。",
            "隐私不是非黑即白，需在特定场景下做出权衡，提供**条件隐私**以增强协议威胁抵抗力。",
            "**威胁抵抗隐私**将成为默认标准，包括限制性隐私和负责任隐私两类解决方案。",
            "企业需要隐私保护敏感商业关系，而零售用户拒绝完全透明的支付轨道。",
            "隐私系统将整合政策控制，在合规的同时不牺牲基础隐私，重新定义链上合规支付。"
          ],
          "en": [
            "Private stablecoins will play a central role in global payments, offering **configurable privacy**.",
            "Privacy tech is moving to production, but wallet support and compliance remain challenges.",
            "Privacy involves tradeoffs; **conditional privacy** improves threat resistance.",
            "**Threat-resistant privacy** will become standard, with throttled and responsible options.",
            "Enterprises need confidentiality; retail users oppose fully transparent payments.",
            "Privacy systems will add policy controls for compliance while preserving core privacy."
          ]
        },
        "slogan": {
          "zh": "【ZK新闻】2026隐私预测：私有稳定币崛起，威胁抵抗成新常态"
        }
      }
    ]
  },
  {
    "date": "2026-01-11",
    "projects": [
      {
        "name": "OOPS: One-time Oblivious Polynomial Signatures",
        "url": "https://eprint.iacr.org/2025/2340",
        "type": "论文",
        "tags": [
          "Kobi Gurkan",
          "Oblivious PRF"
        ],
        "summary": {
          "zh": "Gurkan等人在{{name}}论文中提出了一种基于配对椭圆曲线多项式的一次性遗忘多项式签名方案OOPS，支持最多n个消息的安全签名，并展示了其在可委托签名、1-out-of-n遗忘传输和部分遗忘PRF等协议中的应用。",
          "en": "Gurkan et al. propose OOPS, a one-time oblivious polynomial signature scheme based on pairing-based elliptic curves, supporting secure signatures for up to n messages, with applications in delegatable signatures, 1-out-of-n oblivious transfer, and partially oblivious PRFs."
        },
        "notes": {
          "zh": [
            "OOPS基于配对椭圆曲线多项式构建，可安全签名最多n个不同消息",
            "签名超过n个消息会导致参数下签名可被伪造，需定期重新参数化",
            "方案支持构建可委托签名，增强签名功能的灵活性",
            "可用于实现1-out-of-n遗忘传输，提升隐私保护能力",
            "支持部分遗忘PRF，平衡计算效率与隐私需求",
            "展示了OOPS在多种高效密码协议中的实际应用潜力"
          ],
          "en": [
            "OOPS is built on polynomials over pairing-based elliptic curves, securely signing up to n different messages.",
            "Signing more than n messages allows forgery under given parameters, requiring occasional reparameterization.",
            "Supports delegatable signatures, enhancing signature functionality flexibility.",
            "Enables 1-out-of-n oblivious transfer, improving privacy protection.",
            "Supports partially oblivious PRFs, balancing computational efficiency and privacy needs.",
            "Demonstrates OOPS's potential in various efficient cryptographic protocols."
          ]
        },
        "slogan": {
          "zh": "【ZK论文】OOPS：一次性遗忘多项式签名，开启高效密码协议新篇章"
        }
      }
    ]
  },
  {
    "date": "2026-01-12",
    "projects": [
      {
        "name": "Fully Secure DKG Protocols for Discrete Logarithm Revisited",
        "url": "https://eprint.iacr.org/2026/042",
        "type": "论文",
        "tags": [
          "Karim Baghery",
          "DKG"
        ],
        "summary": {
          "zh": "Baghery在{{name}}论文中重新审视了离散对数场景下的完全安全鲁棒DKG协议，提出了三种更高效的替代方案，均实现O(n)计算复杂度，并在安全性、效率和轮数上提供不同权衡。",
          "en": "Baghery revisits fully secure robust DKG protocols for discrete logarithm in their {{name}}paper, proposing three more efficient alternatives with O(n) computational complexity and different trade-offs in security, efficiency, and round complexity."
        },
        "notes": {
          "zh": [
            "传统GJKR协议存在O(n²)计算复杂度问题，影响可扩展性",
            "新协议一保持完全安全，即使面对计算无界对手也能保证公钥均匀随机",
            "新协议二在计算效率上更优，公钥分布计算不可区分于均匀分布",
            "新协议三将协议二简化为3轮，是Atapoor等人偏置构造的安全轮数缩减变体",
            "相比近期低轮完全安全DKG协议，新3轮协议仅需O(n)指数运算而非O(n²)",
            "研究为DKG协议提供了更灵活的安全-效率权衡选择"
          ],
          "en": [
            "Traditional GJKR protocol has O(n²) cost, limiting scalability.",
            "Protocol 1: full security, uniformly random public key.",
            "Protocol 2: better efficiency, indistinguishable public keys.",
            "Protocol 3: 3 rounds, secure variant of Atapoor et al.",
            "New 3-round protocol needs only O(n) exponentiations.",
            "Enables flexible security-efficiency trade-offs for DKG."
          ]
        },
        "slogan": {
          "zh": "【ZK论文】DKG协议新突破：三种高效方案实现O(n)复杂度，安全与效率兼得"
        }
      }
    ]
  },
  {
    "date": "2026-01-13",
    "projects": [
      {
        "name": "SNARGs for NP and Non-Signaling PCPs, Revisited",
        "url": "https://eprint.iacr.org/2026/006",
        "type": "论文",
        "tags": [
          "Lalita Devadas",
          "LWE",
          "Gentry-Wichs Barrier"
        ],
        "summary": {
          "zh": "Devadas等人在{{name}}论文中重新探讨了基于非信号PCP构建NP的SNARGs，提出候选方案并证明其在LWE假设和多项式理想成员证明的数学猜想下的安全性，突破了Gentry-Wichs黑盒障碍。",
          "en": "Devadas et al. revisit building SNARGs for NP using non-signaling PCPs, propose a candidate scheme with security under LWE and a mathematical conjecture, circumventing the Gentry-Wichs black-box barrier."
        },
        "notes": {
          "zh": [
            "使用指数长度PCP可绕过现有障碍，构建NP的SNARGs",
            "提出非自适应SNARG候选方案，安全性基于LWE等标准假设",
            "引入关于实数域上多项式理想的数学猜想（非密码学假设）",
            "安全性分析非黑盒使用SNARG敌手，突破Gentry-Wichs黑盒障碍",
            "为不受Gentry-Wichs障碍限制的NP SNARGs构建提供蓝图",
            "重新评估非信号PCP在SNARGs构建中的潜力"
          ],
          "en": [
            "Exponential-length PCPs circumvent existing barriers for NP SNARGs",
            "Propose non-adaptive SNARG candidate with security under LWE",
            "Introduce mathematical conjecture on polynomial ideals (non-cryptographic)",
            "Non-black-box adversary use breaks Gentry-Wichs black-box barrier",
            "Blueprint for NP SNARGs not subject to Gentry-Wichs barrier",
            "Re-evaluate potential of non-signaling PCPs in SNARG construction"
          ]
        },
        "slogan": {
          "zh": "【ZK论文】突破 Gentry-Wichs 障碍：NP SNARG 重新被点亮"
        }
      }
    ]
  },
  {
    "date": "2026-01-14",
    "projects": [
      {
        "name": "Argo MAC: Garbling with Elliptic Curve MACs",
        "url": "https://eprint.iacr.org/2026/049",
        "type": "论文",
        "tags": [
          "Liam Eagen",
          "Bitcoin",
          "BitVM"
        ],
        "summary": {
          "zh": "Eagen和Lai在{{name}}论文中提出了一种新的混淆原语Argo MAC，可将曲线点的比特分解编码高效转换为同态MAC，使混淆SNARK验证器效率提升超过1000倍。",
          "en": "Eagen and Lai proposed a new garbling primitive, Argo MAC, in their {{name}}paper, efficiently translating bit decomposition of curve points to homomorphic MACs, enabling over 1000× more efficient garbled SNARK verifiers."
        },
        "notes": {
          "zh": [
            "Argo MAC是一种新的混淆原语，用于优化比特币等链下密码学应用",
            "可将曲线点的比特分解编码高效转换为同态MAC，提升混淆效率",
            "支持构建基于配对的SNARK验证器的混淆版本，效率提升显著",
            "与BitVM等近期工作结合，扩展比特币智能合约的表达能力",
            "后续工作将详细描述如何用Argo MAC构建混淆SNARK验证器",
            "该技术有助于推动比特币链下计算和验证的规模化应用"
          ],
          "en": [
            "Argo MAC is a new garbling primitive for off-chain cryptography like Bitcoin.",
            "Efficiently translates bit decomposition of curve points to homomorphic MACs.",
            "Enables construction of garbled SNARK verifiers for pairing-based SNARKs.",
            "Integrates with recent work like BitVM to enhance Bitcoin smart contracts.",
            "Subsequent work will detail garbled SNARK verifier construction.",
            "Facilitates scalable off-chain computation and verification for Bitcoin."
          ]
        },
        "slogan": {
          "zh": "【ZK论文】Argo MAC：椭圆曲线MAC混淆技术，提升SNARK验证效率超1000倍"
        }
      }
    ]
  },
  {
    "date": "2026-01-15",
    "projects": [
      {
        "name": "zkEVM Security Overview",
        "url": "https://zkevm.ethereum.foundation/blog/zkevm-security-overview",
        "type": "博客",
        "tags": [
          "Ethereum Foundation",
          "Multiproofs"
        ],
        "summary": {
          "zh": "Ethereum Foundation在博客中讨论了zkEVM升级的安全问题，重点关注zkVM安全、客户端多样性和形式验证，提出了多证明策略等缓解措施。",
          "en": "Ethereum Foundation discusses zkEVM upgrade security in a blog, focusing on zkVM security, client diversity, and formal verification, with mitigations like multiproofs strategy."
        },
        "notes": {
          "zh": [
            "zkEVM升级引入证明者执行EVM并生成证明，降低验证者硬件和网络需求",
            "安全关注点包括网络组成变化、客户端和zkVM多样性、客程序风险",
            "多证明策略要求验证多个zkVM+STF组合证明以增强安全性",
            "形式验证项目旨在验证zkSNARK协议和虚拟机实现，但非必需",
            "zkVM支持有限ISA和系统调用，编译客程序可能引入新bug",
            "团队应避免不必要代码更改，加强测试，并分析共享故障点"
          ],
          "en": [
            "zkEVM upgrade introduces provers to execute EVM and generate proofs, reducing verifier hardware and network needs.",
            "Security concerns include network composition changes, client and zkVM diversity, and guest program risks.",
            "Multiproofs strategy requires verifying multiple zkVM+STF combination proofs for enhanced security.",
            "Formal verification project aims to verify zkSNARK protocols and VM implementations, but not mandatory.",
            "zkVMs support limited ISA and syscalls, compiling guest programs may introduce new bugs.",
            "Teams should avoid unnecessary code changes, enhance testing, and analyze shared failure points."
          ]
        },
        "slogan": {
          "zh": "【ZK安全】zkEVM安全升级：多证明策略与客户端多样性如何保障以太坊未来？"
        }
      }
    ]
  },
  {
    "date": "2026-01-17",
    "projects": [
      {
        "name": "BABE: Verifying Proofs on Bitcoin Made 1000x Cheaper",
        "url": "https://eprint.iacr.org/2026/065",
        "type": "论文",
        "tags": [
          "Sanjam Garg",
          "Bitcoin",
          "Witness Encryption"
        ],
        "summary": {
          "zh": "Garg等人在{{name}}论文中提出BABE协议，通过结合见证加密和高效混淆电路，将比特币上的证明验证链下成本降低三个数量级，同时保持链上低成本。",
          "en": "Garg et al. proposed the BABE protocol in their {{name}}paper, combining witness encryption and efficient garbled circuits to reduce off-chain proof verification costs on Bitcoin by three orders of magnitude while maintaining low on-chain costs."
        },
        "notes": {
          "zh": [
            "比特币脚本语言表达能力有限且区块空间小，证明验证是长期挑战",
            "BitVM2链上交易费用极高（不愉快路径超1.4万美元），BitVM3虽降低链上成本但链下存储和设置成本巨大（混淆电路达42GB）",
            "BABE使用线性配对关系的见证加密方案验证Groth16证明，结合高效混淆电路实现安全两方计算",
            "设计基于Argo MAC工作，提供椭圆曲线上同态MAC的高效混淆方案",
            "协议在保持BitVM3链上成本节约的同时，将链下存储和设置成本降低三个数量级",
            "应用包括扩展比特币和实现比特币资产在其他区块链中的无信任使用"
          ],
          "en": [
            "Bitcoin's limited scripting language and small block space make proof verification challenging",
            "BitVM2 has high on-chain fees (>$14k in unhappy path), BitVM3 reduces on-chain costs but off-chain storage/setup is huge (42GB garbled circuits)",
            "BABE uses witness encryption for linear pairings to verify Groth16 proofs, combined with efficient garbled circuits for secure two-party computation",
            "Design builds on Argo MAC for efficient garbling of homomorphic MACs on elliptic curves",
            "Protocol reduces off-chain costs by three orders of magnitude while maintaining BitVM3's on-chain savings",
            "Applications include scaling Bitcoin and enabling trustless use of Bitcoin assets in other blockchains"
          ]
        },
        "slogan": {
          "zh": "【ZK论文】比特币证明验证革命：BABE协议让成本骤降1000倍！"
        }
      }
    ]
  },
  {
    "date": "2026-01-18",
    "projects": [
      {
        "name": "Timed Commitments and Timed Encryption: Generic Constructions and Instantiations from Isogenies",
        "url": "https://eprint.iacr.org/2026/057",
        "type": "论文",
        "tags": [
          "Mingjie Chen",
          "Isogenies"
        ],
        "summary": {
          "zh": "Chen和Meers在{{name}}论文中提出了基于同源的非交互定时承诺和定时加密通用构造，使用可验证随机函数等高效组件，实现后量子安全。",
          "en": "Chen and Meers proposed generic constructions for non-interactive timed commitments and timed encryption from isogenies in their {{name}}paper, using efficient building blocks like verifiable random functions for post-quantum security."
        },
        "notes": {
          "zh": [
            "定时承诺在电子投票、合同签名等场景有广泛应用，但现有方案多依赖非后量子假设或低效组件",
            "论文提出通用构造LEIBNITC和NYTPKE，仅需可验证随机函数、陷门延迟函数和NIZK等高效组件",
            "基于同源实例化实现后量子安全，LEIBNITC承诺大小仅2328比特，是目前最高效的定时承诺之一",
            "解决了传统方案依赖经典假设或全同态加密等低效组件的问题",
            "为后量子密码学提供了实用的定时密码学原语",
            "扩展了同源密码学在定时承诺和加密领域的应用"
          ],
          "en": [
            "Timed commitments are crucial for e-voting and contracts, but most schemes lack post-quantum security or are inefficient.",
            "LEIBNITC and NYTPKE use efficient primitives like verifiable random functions and trapdoor delay functions.",
            "Isogeny-based designs offer post-quantum security and small commitments (2328 bits).",
            "Avoids reliance on fully homomorphic encryption and other costly components.",
            "Enables practical post-quantum timed cryptography.",
            "Showcases new applications for isogeny cryptography in timed commitments and encryption."
          ]
        },
        "slogan": {
          "zh": "【ZK论文】后量子定时承诺新突破：基于同源的高效构造"
        }
      }
    ]
  }
]