[
  {
    "date": "2026-01-05",
    "projects": [
      {
        "name": "DNS-Anchored zk-SNARK Proofs: A Stateless Alternative to ACME Challenge-Response for Domain Control Validation",
        "url": "https://eprint.iacr.org/2025/2332",
        "type": "论文",
        "tags": [
          "Abhinav Vishnu",
          "DNS",
          "ACME"
        ],
        "summary": {
          "zh": "Abhinav Vishnu在{{name}}论文中提出了PTX协议，利用zkSNARK实现异步、非交互式域控制验证，无需活动服务器，通过DNS TXT记录锚定证明。",
          "en": "Abhinav Vishnu proposed the PTX protocol in {{name}}paper, using zkSNARK for asynchronous, non-interactive domain control validation without active servers, anchored via DNS TXT records."
        },
        "notes": {
          "zh": [
            "PTX协议利用zkSNARK实现异步、非交互式域控制验证，替代传统ACME协议",
            "通过DNS TXT记录锚定证明，无需活动Web服务器或开放网络端口",
            "电路设计将临时秘密绑定到范围元数据，支持客户端验证和隐私保护",
            "使用Groth16和Poseidon实现，仅1,756约束，验证时间低于15ms",
            "有效缓解重放攻击，适用于无服务器、静态和隔离部署环境",
            "为去中心化环境中的身份断言提供隐私保护替代方案"
          ],
          "en": [
            "PTX protocol uses zkSNARK for asynchronous, non-interactive domain control validation, replacing traditional ACME",
            "Anchors proofs via DNS TXT records, eliminating need for active web servers or open ports",
            "Circuit design binds ephemeral secrets to scoped metadata, enabling client-side verification and privacy",
            "Implemented with Groth16 and Poseidon, only 1,756 constraints, verification under 15ms",
            "Mitigates replay attacks, suitable for serverless, static, and air-gapped deployments",
            "Provides privacy-preserving alternative for identity assertions in decentralized environments"
          ]
        },
        "slogan": {
          "zh": "【ZK论文】告别 ACME 挑战：用 zkSNARK 在 DNS 上完成域名验证"
        }
      }
    ]
  },
  {
    "date": "2026-01-06",
    "projects": [
      {
        "name": "SUMSIG: Compact Code-Based Signatures from Sum-Check Protocols",
        "url": "https://eprint.iacr.org/2025/2331",
        "type": "论文",
        "tags": [
          "Debrup Chatterjee",
          "Syndrome Decoding"
        ],
        "summary": {
          "zh": "Debrup Chatterjee在{{name}}论文中提出了SumSig，一种基于编码的数字签名方案，利用Sum-Check协议减少对重复的依赖，通过单次扩展域验证实现可忽略的误差，签名约5-8KB。",
          "en": "Debrup Chatterjee proposed SumSig, a code-based digital signature scheme leveraging sum-check protocols to reduce repetition reliance, achieving negligible error via single extension field verification, with signatures ~5-8KB."
        },
        "notes": {
          "zh": [
            "SumSig利用Sum-Check协议替代重复Σ协议，减少签名生成依赖",
            "通过扩展域单次验证实现可忽略的误差，无需重复操作",
            "签名大小约5-8KB，公钥50-100KB，提供不同权衡",
            "基于Syndrome Decoding问题，在随机预言模型中有准紧规约",
            "相比Wave和LESS等方案，在签名和公钥大小间提供新选择",
            "这是首次公开版本，欢迎反馈，关注后量子密码学进展"
          ],
          "en": [
            "SumSig uses sum-check protocols to replace repetitive Σ-protocols, reducing signature generation reliance.",
            "Achieves negligible error via single extension field verification without repetition.",
            "Signature size ~5-8KB, public key 50-100KB, offering different trade-offs.",
            "Based on Syndrome Decoding problem with quasi-tight reduction in random oracle model.",
            "Provides new choice in signature/public key size compared to Wave and LESS.",
            "First public version; feedback welcome, focusing on post-quantum cryptography."
          ]
        },
        "slogan": {
          "zh": "【ZK论文】后量子签名新突破：SumSig用Sum-Check协议实现紧凑签名"
        }
      }
    ]
  }
]